docs: use mermaid instead of plantuml
